app/controllers/registrations_controller.rb

  def update
      # required for settings form to submit when password is left blank
      if params[:user][:password].blank?
        params[:user].delete("password")
        params[:user].delete("password_confirmation")
      end

      @user = User.find(current_user.id)
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 14 LIMIT 1
UPDATE "users" SET "first_name" = 'MyFirstName', "last_name" = 'MyLastName', "encrypted_password" = '$2a$04$eMbu8OhbJ5l8tah6a81b9umruJrCoh6dizBdKd4/MJexNgyEamiAC', "updated_at" = '2013-05-06 21:33:41.543364' WHERE "users"."id" = 10